1. Create 1-D array(series ) in pandas.

In [1]:
import pandas as pd
 
data = [1, 2, 3, 4, 5]
example = pd.Series(data)
print(example)

0    1
1    2
2    3
3    4
4    5
dtype: int64

2. Create a pandas series from a list

In [2]:
import pandas as pd

MyList = ['Athul','Arun','Rahul']

MySeries = pd.Series(MyList)

print(MySeries)

0    Athul
1     Arun
2    Rahul
dtype: object

3. Create a pandas series with user define index.

In [5]:
import pandas as pd
import numpy as np

mydata = np.array(['g', 'e', 'e', 'k', 's'])
series1 = pd.Series(mydata, index =[1, 2, 3, 4, 5])
print(series1)

1    g
2    e
3    e
4    k
5    s
dtype: object

4. Write a program to create Dataframe by Dictionay .

In [6]:
import pandas as pd

dict1 = {
    'Name' : ['Athul', 'Arun', 'Rahul'],
    'Age' : [23, 21, 22],
    'place' : ['Banalore', 'Mumbai', 'Delhi'],
}

df = pd.DataFrame(dict1)
  
df

    Name  Age     place
0  Athul   23  Banalore
1   Arun   21    Mumbai
2  Rahul   22     Delhi

5. Create DataFrame and put index

In [7]:
import pandas as pd

dict1 = {
    'Name' : ['Athul', 'Arun', 'Rahul'],
    'Age' : [23, 21, 22],
    'place' : ['Banalore', 'Mumbai', 'Delhi'],
}

df = pd.DataFrame(dict1, index =['1','2','3'])
  
df

    Name  Age     place
1  Athul   23  Banalore
2   Arun   21    Mumbai
3  Rahul   22     Delhi

6.Accessing Data from Series with Position
s = pd.Series([1,2,3,4,5],index = ['a','b','c','d','e'])

In [15]:
import pandas as pd
s = pd.Series([1,2,3,4,5],index = ['a','b','c','d','e'])
print(s['a'])

1

7.Create a DataFrame in which you have 2 columns(Name , Age) . And fill the data into this columns and use user define index

In [28]:
import pandas as pd

students = []

df = pd.DataFrame(students,columns=['Name', 'Age'])
df.loc[0]=['Abhi',21]
df.loc[len(df.index)]=['Manu',20]
df.loc[len(df.index)]=['Tanu',21]
df

   Name Age
0  Abhi  21
1  Manu  20
2  Tanu  21